Repository: Belarus/OmegaT-Common.TMX
Catalog: tmx/non-segmented/drupal-7.x.tmx
Source language: en
Languages: be

source: The testing framework could not be installed because the PHP <a href="@hash_url">hash</a> extension is disabled.
be: Фрэймворк для тэсту не змог быць інсталяваны, таму што пашырэнне PHP <a href="@hash_url">hash</a> забаронена.

source: The testing framework requires the DOMDocument class to be available. Check the configure command at the <a href="@link-phpinfo">PHP info page</a>.
be: Фрэймворк для тэсціравання патрабуе, каб DOMDocument класы былі дастуныя. Праверце канфігурацыю каманд на <a href="@link-phpinfo">старонцы інфармацыі PHP</a>.

source: The testing framework requires the PHP <a href="@open_basedir-url">open_basedir</a> restriction to be disabled. Check your webserver configuration or contact your web host.
be: Тэстуючы фрэймворк патрабуе, каб абмежаванне<a href="@open_basedir-url">open_basedir</a> у PHP было адключана. Праверце канфігурацыю вашага вэбсервера альбо свяжыцеся з вашым вэб-хостам.

source: The testing framework requires the PHP memory limit to be at least %memory_minimum_limit. The current value is %memory_limit. <a href="@url">Follow these steps to continue</a>.
be: Фрэймворк для тэсціравання патрабуе ліміт памяці PHP як мінімум %memory_minimum_limit. Бягучае значэнне - %memory_limit. <a href="@url">Для працягу кіруйцеся гэтымі крокамі </a>.

source: The text format %format has been updated.
be: Тэкставы фармат %format быў абноўлены.

source: The text format ordering has been saved.
be: Парадак тэкставага фармату быў захаваны.

source: The text to be used for this link in the menu.
be: Тэкст, які будзе выкарыстоўвацца для гэтага пункту меню.

source: The throbber display does not show the status of uploads but takes up less space. The progress bar is helpful for monitoring progress on large uploads.
be: Тробер не адлюстроўвае статуса загрузкі, аднак займае меньш месца. Паласа загрузкі дапамагае кантраляваць працэс буйных загрузак.

source: The title attribute is used as a tooltip when the mouse hovers over the image.
be: Атрыбут title выкарыстоўваецца як падказка, калі мыш наведзена на выяву.

source: The title is used as a tool tip when the user hovers the mouse over the image.
be: Title выкарыстоўваецца як падказка, калі карыстальнік навёў мыш над выявай.

source: The title of current display of the view.
be: Загаловак бягучага адлюстравання віда

source: The title of the block as shown to the user.
be: Загаловак блоку (як яго пабачыць карыстальнік).

source: The title of the comment.
be: Загаловак каментара.

source: The title of the new field. The title will be shown to the user. An example title is "Favorite color".
be: Загаловак новага полю (будзе паказаны карыстальніку). Напрыклад, "Улюбёны колер".

source: The title of the node.
be: Назва вузла.

source: The title of the page where users invite friends.
be: Загаловак старонкі, куды карыстальнікі запрашаюць іншых.

source: The total number of digits to store in the database, including those to the right of the decimal.
be: Агульная колькасць лічбаў для захоўвання ў базе дадзеных, у тым ліку справа ад дзесятковай коскі.

source: The translation file %filename appears to have a missing or malformed header.
be: Файл перакладу %filename ня мае загалоўку або яго загаловак пашкоджаны.

source: The translation file %filename contains a syntax error on line %line.
be: Файл перакладу %filename утрымлівае сінтаксічную памылку ў радку %line.

source: The translation file %filename contains an error: "msgctxt" is unexpected on line %line.
be: Перакладзены файл %filename утрымлівае памылку: "msgctxt" нечаканае на радку %line.

source: The translation file %filename contains an error: "msgid" is unexpected on line %line.
be: Файл перакладу %filename утрымлівае памылку: непрадбачанае "msgid" у радку %line.

source: The translation file %filename contains an error: "msgid_plural" was expected but not found on line %line.
be: Файл перакладу %filename утрымлівае памылку: чаканае "msgstr_plural" ня знойдзена ў радку %line.

source: The translation file %filename contains an error: "msgstr" is unexpected on line %line.
be: Файл перакладу %filename утрымлівае памылку: нечаканае "msgstr" у радку %line.

source: The translation file %filename contains an error: "msgstr" was expected but not found on line %line.
be: Файл перакладу %filename утрымлівае памылку: чаканае "msgstr" ня знойдзена ў радку %line.

source: The translation file %filename contains an error: "msgstr[]" is unexpected on line %line.
be: Файл перакладу %filename утрымлівае памылку: непрадбачанае "msgstr[]" у радку %line.

source: The translation file %filename contains an error: the plural formula could not be parsed.
be: Файл перакладу %filename змяшчае памылку: немагчыма апрацаваць множны лік.

source: The translation file %filename contains an error: there is an unexpected string on line %line.
be: Файл перакладу %filename утрымлівае памылку: нечаканы тэкст у радку %line.

source: The translation file %filename ended unexpectedly at line %line.
be: Файл перакладу %filename раптоўна сконьчваецца на радку %line.

source: The translation file %filepath contains an error: the plural formula could not be parsed.
be: Пераклад файла %filepath утрымлівае памылку: мнагазначная формула не можа быць прааналізавана.

source: The translation import failed, because the file %filename could not be read.
be: Імпарт праваліўся: немагчыма прачытаць файл перакладу %filename.

source: The translation import of %filename failed.
be: Імпарт перакладу з %filename быў беспаспяховым.

source: The translation was successfully imported. There are %number newly created translated strings, %update strings were updated and %delete strings were removed.
be: Пераклад быў паспяхова імпартаваны. Ёсць %number толькі што перакладзеных радкоў, %update радкоў было абноўлена і %delete было выдалена.

source: The trimmed version of your post shows what your post looks like when promoted to the main page or when exported for syndication.<span class="no-js"> You can insert the delimiter "&lt;!--break--&gt;" (without the quotes) to fine-tune where your post gets split.</span>
be: Апрацаваная версія вашага паста, адлюстроўвае як ваш пост выглядае на галоўнай старонцы ці калі экспартуецца на сіндыкацыю.<span class="no-js"> Вы можаце ўставіць знак падзельніка "&lt;!--break--&gt;" ( без двукосся) каб дакладна ўрэгуляваць дзе ваш пост будзе перарывацца.</span>

source: The type of database your @drupal data will be stored in.
be: Тып базы дадзеных, у якой будзе захоўвацца ваша інфармацыя сістэмы @drupal.

source: The type of form element you would like to present to the user when creating this field in the %type type.
be: Тып элемента формы, які вы жадаеце падаць карыстальніку, пры стварэнні гэтага поля ў тыпе %type.

source: The type of the node.
be: Тып вузла.

source: The uninstall process removes all data related to a module. To uninstall a module, you must first disable it on the main <a href="@modules">Modules page</a>.
be: Працэс выдалення перамесціць усе дадзеныя, злучаныя з модулем. Каб выдаліць модуль, спачатку вам патрэбна адключыць яго на галоўнай <a href="@modules">Старонцы модуляў <a>.

source: The unique ID of the comment.
be: Унікальны ID каментара.

source: The unique ID of the content item, or "node".
be: Унікальны ID элемента змесціва ці "вузла".

source: The unique ID of the node's latest revision.
be: Унікальны ID апошняй версіі вузла.

source: The unique ID of the original-language version of this node, if one exists.
be: Унікальны ID вузла у версіі першапачатковай мовы, калі такі існуе.

source: The unique ID of the taxonomy term.
be: Унікальны ідэнтыфікатар тэрміна таксанаміі.

source: The unique ID of the taxonomy vocabulary.
be: Унікальны ідэнтыфікатар слоўніка таксанаміі.

source: The unique ID of the uploaded file.
be: Унікальны ID для спампаваных файлаў.

source: The unique ID of the user account.
be: Унікальны ID карыстальніка акаўнта

source: The update has been performed.
be: Абнаўленне было выканана.

source: The update has encountered an error.
be: Здарылася памылка пры абнаўленні.

source: The update.php script is accessible to everyone without authentication check, which is a security risk. You must change the $update_free_access value in your settings.php back to FALSE.
be: Скрыпт update.php даступны кожнаму без праверкі аўтарызацыі, гэта стварае рызыку бяспекі. Вам патрэбна змяніць значэнне $update_free_access у файле settings.php на FALSE.

source: The upload directory %directory for the file field !name could not be created or is not accessible. A newly uploaded file could not be saved in this directory as a consequence, and the upload was canceled.
be: Немагчыма стварыць каталог загрузкі %directory для поля файла !name альбо ён недаступен. Па гэтай прычыне загружаны файл не можа быць захаваны ў каталогу, таму і загрузка была адменена.

source: The user account %id does not exist.
be: Імя карыстальніа %id не існуе.

source: The user account %name cannot be cancelled.
be: Акаўнт карыстальніка %name не можа быць выдалены.

source: The user must enter a value.
be: Карыстальнік мусіць увесці значэнне.

source: The user or author name.
be: Імя карыстальніка ці аўтара.

source: The user who originally uploaded the file.
be: Карыстальнік, які запампаваў гэты файл.

source: The user who visited the site.
be: Карыстальнік, які наведаў сайт.

source: The user's picture, if allowed.
be: Выява карыстальніка, калі дазволена.

source: The username %name does not exist.
be: Імя карыстальніка %name не існуе.

source: The username %name has not been activated or is blocked.
be: Гэта імя карыстальніка - %name - неактыўнае або заблакаванае.

source: The username %name is allowed.
be: Імя карыстальніка %name дазволена.

source: The username %name is not allowed.
be: Імя карыстальніка %name не дазволена.

source: The username %name is too long: it must be %max characters or less.
be: Імя карыстальніка %name занадта доўгае: яно павінна быць не больш за %max сімвалаў.

source: The username cannot begin with a space.
be: Імя карыстальніка не можа пачынацца з прабела.

source: The username cannot contain multiple spaces in a row.
be: Імя карыстальніка не можа ўтрымліваць некалькі прабелаў запар.

source: The username cannot end with a space.
be: Імя карыстальніка не можа заканчвацца на прабел.

source: The username contains an illegal character.
be: Імя карыстальніка ўтрымлівае недапушчальныя сімвалы.

source: The username of the user to which you would like to assign ownership.
be: Імя карыстальніка, якому вы жадаеце надаць правы.

source: The value of this field is being determined by the %function function and may not be changed.
be: Значэнне гэтага поля вызначаецца функцыяй %function і не можа быць змененная.

source: The value provided for %field is not a valid URL.
be: Значэнне ў полі %field ня з'яўляецца слушнай спасылкай.

source: The verbose data will be printed along with the standard assertions and is useful for debugging. The verbose data will be erased between each test suite run. The verbose data output is very detailed and should only be used when debugging.
be: Падрабязныя дадзеныя будуць надрукаваны ў адпаведнасці са стандартам сцвярджэнняў і з’яўляюцца карыснымі для адладкі. Падрабязныя дадзеныя будуць сцёртыя паміж кожным запускам набора тэсціравання. Падрабязныя дадзеныя адлюстроўваюцца дэталёва, пагэтаму яны павінны выкарыстоўвацца толькі для адладкі.

source: The version of PHP you are using has known issues with PostgreSQL. You need to upgrade PHP to 5.2.11, 5.3.1 or greater.
be: Гэтая версія PHP не можа працаваць з PostgreSQL. Вам неабходна аднавіць PHP да 5.2.11, 5.3.1 або навейшай.

source: The vocabulary the taxonomy term belongs to.
be: Тэрмін слоўніка таксанаміі належыць да.

source: The vocabulary which supplies the options for this field.
be: Слоўнік, які надае опцыі для гэтага поля.

source: The web-accessible URL for the file.
be: URL для доступу да файла праз вэб.

source: The website encountered an unexpected error. Please try again later.
be: На сайце адбылася раптоўная памылка. Калі ласка, паспрабуйце пазней.

source: The weights define the order in which the form fields are shown. Lighter fields "float up" towards the top of the category.
be: Вага вызначае, у якой пасьлядоўнасці будуць паказаныя палі формы. Больш лёгкія "ўсплываюць" дагары.

source: The winning poll answer.
be: Адказ, які перамог ў апытанні.

source: Theme
be: Тэма

source: Theme configuration
be: Канфігурацыя тэмы

source: Theme key "@key" not found.
be: Ключ тэмы "@key" не знойдзены.

source: Theme-engine-specific settings
be: Наладкі спецыфічнага рухавіка тэмы

source: Theme-specific settings
be: Наладкі тэмы

source: Themes
be: Тэмы

source: There are <a href="@taxcontrib">many contributed modules</a> that extend the behavior of the Taxonomy module for both display and organization of terms.
be: Існуе <a href="@taxcontrib">шмат унесеных модуляў</a>, якія пашыраюць магчымасці модуля Taxonomy для адлюстравання і арганізацыі тэрмінаў.

source: There are @count items left to index.
be: Элементы, колькасцю @count, былі пакінуты для індэксавання.

source: There are currently %members and %visitors online.
be: Зараз %members ды %visitors анлайн.

source: There are currently no access rules.
be: На бягучы момант правы дасягу ня вызначаныя.

source: There are currently no effects in this style. Add one by selecting an option below.
be: У дадзены час у гэтым стылі няма ніякіх эфектаў. Дадаць яго, абраўшы параметр унізе.

source: There are currently no posts in this category.
be: Няма допісаў у катэгорыі.

source: There are currently no styles. <a href="!url">Add a new one</a>.
be: У дадзены час не існуе ніякіх стыляў. <a href="!url">Дадаць новы</a>.

source: There are no fields yet added. You can add new fields on the <a href="@link">Manage fields</a> page.
be: Яшчэ не было дададзена палеў. Вы можаце дадаць новыя палі на старонцы <a href="@link">Кіраваць палямі</a>.

source: There are no menu links yet. <a href="@link">Add link</a>.
be: Пакуль што тут няма аніводнага пункту меню. <a href="@link">Дадаць пункт меню</a>.

source: There are security updates available for one or more of your modules or themes. To ensure the security of your server, you should update immediately!
be: Існуюць абнаўленні даступныя для аднаго ці некалькіх модуляў альбо тэмаў. Каб гарантаваць бяспеку вашаму серверу вам неабходна немарудзячы зрабіць аднаўленне!

source: There are several decisions you will need to make before defining a field for content, comments, etc.:
be: Ёсць некалькі рашэнняў, якія вы павінны зрабіць, перш чым вызначаць поле для кантэнта, каментароў і г.д.

source: There are two main reasons for reusing fields. First, reusing fields can save you time over defining new fields. Second, reusing fields also allows you to display, filter, group, and sort content together by field across content types. For example, the contributed Views module allows you to create lists and tables of content. So if you use the same field on multiple content types, you can create a View containing all of those content types together displaying that field, sorted by that field, and/or filtered by that field.
be: Ёсць дзве асноўныя прычыны для паўторнага выкарыстоўвання палёў. Па-першае, паўторнае выкарыстоўванне палёў дазваляе зэканоміць час на вызначэнне новых палёў. Па-другое, паўторнае выкарыстоўванне палёў дазваляе адлюстроўваць, фільтраваць, групаваць і сартаваць змесціва па палях сярод тыпаў змесціва. Напрыклад, спрыяльны модуль Views дазваляе ствараць спісы і табліцы зместу. Так што, калі вы выкарыстоўваеце адно і тое ж поле для некалькіх тыпаў змесціва, вы можаце стварыць View, які будзе змяшчаць ўсе гэтыя тыпы змесціва разам: адлюстраваныя, сартаваныя, і / або фільтраваныя па гэтаму полю.

source: There are two types of actions: simple and advanced. Simple actions do not require any additional configuration, and are listed here automatically. Advanced actions need to be created and configured before they can be used, because they have options that need to be specified; for example, sending an e-mail to a specified address, or unpublishing content containing certain words. To create an advanced action, select the action from the drop-down list in the advanced action section below and click the <em>Create</em> button.
be: Існуе два тыпа дзеянняў: простыя і прасунутыя. Простыя дзеянні не патрабуюць ніякіх дадатковых наладжванняў і аўтаматычна заносяцца ў спіс. Прасунутыя дзеянні неабходна спачатку стварыць і наладзіць, перш чым яны могуць быць выкарыстаны, таму што ў іх ёсць опцыі, якія павінны быць дакладна вызначаны; напрыклад, адпраўка e-mail на зададзены адрас, ці забарона на апублікаванне змесціва, якое ўтрымоўвае вызначаныя словы. Каб зрабіць прасунутае дзеянне, абярыце форму дзеяння са спадальная спісу ў нізе секцыі прасунутых дзеянняў і націсніце кнопку <em>Стварыць</em>.

source: There are updates available for one or more of your modules or themes. To ensure the proper functioning of your site, you should update as soon as possible.
be: Існуюць аднаўленні для аднаго ці болей вашых модуляў альбо тэмаў. Каб забяспечыць якасную працу вашага сайта вам варта зрабіць абнаўленне як мага хутчэй.

source: There are updates available for your version of Drupal. To ensure the proper functioning of your site, you should update as soon as possible.
be: Існуюць даступныя абнаўленні версіі Drupal. Каб гарантаваць якаснае функцыянаванне вашага сайта варта зрабіць абнаўленне як мага хутчэй!

source: There do not appear to be any comments to delete, or your selected comment was deleted by another administrator.
be: Няма каментароў для выдалення, ці выбраны вамі каляндар быў выдалены іншым адміністратарам.

source: There is a security update available for your version of Drupal. To ensure the security of your server, you should update immediately!
be: Гэта апдэйт сістэмы бяспекі для вашай версіі Drupal. Для забеспячэння беспекі вашага сервера, тэрмінова ўсталюйце апдэйт.

source: There is a tab on this page for each module that defines triggers. On this tab you can assign actions to run when triggers from the <a href="@module-help">@module-name module</a> happen.
be: На гэтай старонцы ёсць закладка для кожнага модуля, які вызначае трыгеры. Тут вы можаце адзначыць дзеянні, якія будуць ужывацца пры трыгеры з <a href="@module-help">@module-name module</a>.

source: There is already a translation in this language.
be: Ужо існуе пераклад на гэтую мову.

source: There is already an existing account associated with the OpenID identifier that you have provided. However, due to a bug in the previous version of the authentication system, we can't be sure that this account belongs to you. If you are new on this site, please continue registering the new user account. If you already have a registered account on this site associated with the provided OpenID identifier, please try to <a href="@url_password">reset the password</a> or contact the site administrator.
be: Існуючы рахунак злучаны з ідэнтыфікатарам OpenID, які вы падалі. Аднак, у сувязі з памылкай у папярэдняй версіі ідэнтыфікацыі мы не можам быць упэўнены, што гэты рахунак належыць вам. Калі вы новы на гэтым сайце, калі ласка, працягніце рэгістрацыю новага рахунка карыстальніка. Калі ў вас ужо ёсць зарэгістраваны рахунак на гэтым сайце, які злучан з забяспечваным ідэнтыфікатарам OpenID, калі ласка паспрабуйце <a href="@url_password">аднавіць пароль</a> ці звязацца з адміністратарам сайта.

source: There is an optional <em>Blogs</em> menu item added to the Navigation menu, which displays all blogs available on your site, and a <em>My blog</em> item displaying the current user's blog entries.
be: Існуе апцыянальна элемент <em>Меню блогаў</em> даданы ў меню Навігацыі, які адлюстроўвае ўсе даступныя на тваім сайце блогі, і элемент <em>Мой блог</em>, які аблюстроўвае толькі запісы цякучага карыстальніка блога.

source: There is currently %members and %visitors online.
be: Зараз %members ды %visitors анлайн.

source: There is currently no content classified with this term.
be: На цяперашні час не існуе кантэнта класіфікаванага з гэтым тэрмінам.

source: There is data for this field in the database. The field settings can no longer be changed.
be: У базе дадзеных ёсць дадзеныя для гэтага поля. Наладкі поля ня могуць быць зменены.

source: There is new syndicated content from %site.
be: Новы RSS-матэрыял з %site.

source: There is no new syndicated content from %site.
be: Новага RSS-зместу з %site няма.

source: There is not enough memory available to PHP to change this theme's color scheme. You need at least %size more. Check the <a href="@url">PHP documentation</a> for more information.
be: Не хапае памяці для PHP, каб змяніць каляровую схему гэтай тэмы. Вам патрэбна мінімум яшчэ %size. Праверце <a href="@url">дакументацыю PHP</a>, каб атрымаць больш інфармацыі.

source: There was a problem changing the widget for field %label.
be: Узнікла праблема пры змяненні віджэта для поля %label.

source: There was a problem checking <a href="@update-report">available updates</a> for Drupal.
be: Праблема пры спраўджанні <a href='@update-report'> даступныя абнаўленні </ a> для Drupal ..

source: There was a problem checking <a href="@update-report">available updates</a> for your modules or themes.
be: Існавала праблема <a href="@update-report">даступных абнаўленняў</a> для вашых модуляў ці тэмаў.

source: There was a problem creating field %label: !message
be: Праблема стварэння поля %label: !message

source: There was a problem creating field instance %label: @message.
be: Адбылася праблема пры стварэнні экзэмпляра поля %label: @message.

source: There was a problem getting update information. Try again later.
be: Не ўдалося атрымаць даступныя дадзеныя для аднаўлення для аднаго праекту.Існавала праблема атрымання інфармацыі аб абнаўленні. Паспрабуйце пазней яшчэ раз.

source: There was a problem removing the %field from the %type content type.
be: Узнікла праблема пры выдаленні поля %field з тыпу %type змесціва.

source: There was an error adding the post to the book.
be: Адбылася памылка пры даданні поста ў кнігу.

source: There was an error saving the menu link.
be: Адбылася памылка падчас захавання спасылкі меню.

source: These options are only necessary for some sites. If you're not sure what you should enter here, leave the default settings or check with your hosting provider.
be: Гэтыя наладкі патрэбныя толькі для некаторых сайтаў. Калі вы не ўпэўненыя, пакіньце значэнні па змоўчанні або пракансультуйцеся з вашым хостынг-правайдэрам.

source: These options control the default display settings for your entire site, across all themes. Unless they have been overridden by a specific theme, these settings will be used.
be: Гэтыя опцыі кантралююць прадвызначаныя наладкі адлюстравання ўсяго сайта цалкам, па ўсіх тэмах. Калі дадзеныя опцыі не былі змененыя асобнай тэмай, то яны будуць выкарыстаныя.

source: These options control the display settings for the %name theme. When your site is displayed using this theme, these settings will be used.
be: Гэтыя опцыі кантралююць наладкі адлюстравання тэмы %name. Калі дадзеная тэма выкарыстоўваецца для адлюстравання Вашага сайта, гэтыя наладкі будуць выкарыстаныя.

source: These settings apply only to the %field field when used in the %type type.
be: Гэтыя наладкі да поля %field ужываюцца толькі пры выкарыстанні ў тыпе %type.

source: These settings apply to the %field field everywhere it is used.
be: Гэтыя наладкі ўжываюцца ўсюды ў поле %field.

source: These settings apply to the %field field everywhere it is used. Because the field already has data, some settings can no longer be changed.
be: Гэтыя наладкі да поля %field ужываюцца паўсюль, дзе яно выкарыстоўваецца. Паколькі поле ўжо мае дадзеные, некаторыя наладкі ўжо ня могуць быць змененыя.
